/**
 * 编写一个程序,从标准输入读取字符,并把它们写到标准输出中,所有非字母字符都
 * 完全按照它的输入形式输出,字母字符在输出前进行加密.
 * 加密方式: 每个字母被修改为字母表上距其13个位置(前或后)的字母.例如,A被
 * 修改N,B被修改为O,Z被修改为M,以此类推.注意,大小写字母都应该被转换.
 * 提示: 记住字符实际上是一个较小的整型值这一点可能对你有帮助.
 */

#include<stdio.h>


void main() {
    char ch = fgetc(stdin);
    if (ch >= 65 && ch <= 90) {
        if ((ch+13) < 90) {
            ch += 13;
        } else {
            ch -= 13;
        }
    } else if (ch >= 97 && ch <= 122) {
        if ((ch+13) < 122) {
            ch += 13;
        } else {
            ch -= 13;
        }
    }

    fputc(ch, stdout);
}
